Revit 2027 API
BuiltInFailures.WallFailures.UnjoinOnEditWallChange Property
 Line associated with a joined face has been moved. This action will cause the other walls to become disjoined from this face. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnjoinOnEditWallChange { get; }
Public Shared ReadOnly Property UnjoinOnEditWallChange As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnjoinOnEditWallChange {
	FailureDefinitionId^ get ();
}
static member UnjoinOnEditWallChange : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace